<a href="https://colab.research.google.com/github/bitprj/DigitalHistory/blob/Amy/Week5-Lab-Visualizing-the-Translatlantic-Slave-Trade/Lab-Visualize-Sociology.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# <div align="center">Visualizing LinkedIn Profiles and Jobs</div>

## Table of Contents

- Recap
- About the Dataset
    - LinkedIn Profiles and Jobs
        - Facts about the dataset
- Labs and Methodology
- Goals
- **Part 1 - Getting Our Basic Data Analysis Set-Up**
    - Import Libraries and unpack a file
    - Load file
    - Observing the Dataset using Pandas
    - Important Facts About the Dataset
    - Visualizing Number of Company Employees
- **Part 2 - Getting Started with Data Wrangling**
    - Create a copy of the Original Dataset
    - Changing Column Names
    - Moving Column Positions - ```df.reindex()```
    - Removing Unneeded Columns -```df.drop()```
    - Using ```dropna()```
    - Changing Column Type and Sorting - ```df.sort_values()```
    - Finding Unique and similar strings 
    - Working with Strings - ```df['column_name'].str.replace()```
- **Part 3 - Micro Wrangling and Visualization**
    - Between 1960 - 1975
    - Between 1975 - 1990
    - Between 1990 - 2005
    - Between 2005 - 2019
- **Part 4 - Conclusion**
- Resources
- Appendix

## Recap
- By this time, you should have an understanding of how to implement the following:
- Loading a Dataset '.csv' as a dataframe using ```pd.read_csv```
- Observing the properties of the loaded dataset using functions such as:
    - ```pd.head()```
    - ```pd.describe()```
    - ```pd.info()```
- Modifying the dataset by removing ```NaN``` values.
- A conceptual understanding of the term ```object``` in DataFrames.
- Re-indexing columns
- Visualizing Data using ```matplotlib``` and ```pandas```:
    - Scatter plots
    - Barplots
    - Line plots
    - Histograms

## About the Dataset


### LinkedIn Profiles and Jobs
<img src="https://github.com/bitprj/DigitalHistory/blob/Amy/Week5-Lab-Visualizing-the-Translatlantic-Slave-Trade/assets/workersTalking.jpg?raw=1" width="600"> 

Founded in 2002, LinkedIn is an employment-oriented online service that is mainly used for professional networking, and supports over 700 million users to date. It is a site where employers can share job postings and job-seekers can create profiles around their industry experience.

LinkedIn can be utilized as a social network for profesional development, where users can add 'connections' with one another to share posts and view professional-related updates from their network.

#### Facts about the dataset

- The dataset approximately 39,500 LinkedIn profiles.
- The ages of the users range from 20 to 86 years.

- The dataset collects information from profiles across various countries, including the United States, the United Kingdom, Australia, etc.
- The users reported a wide range of start dates for their current position, which range from beginning their job in 1961 to beginning their job in 2019. 
- This dataset contains profiles of employees from a number of major companies, including Facebook, Google, Microsoft, Hewlett Packard, IBM, Infosys, Nokia, and many more.

- The dataset also features other information about the profiles, including their Number of Connections, and whether or not they have a profile picture or a subscription to LinkedIn Premium.

## Labs and Methodology
Congratulations, you have made it to the first lab of this course. The purpose of these labs is to help you apply the Data Science pipeline in a project-based environment. You will be using the tools taught to you in the previous modules and adopt and Question and Answer based approach when you work with the dataset.
We have divided our approach into 4 parts:
- For this project, we start by asking questions which you will answer in code and simple explanations.

*example* - change the name of 'column_x' to 'column y' </br>
**answer**: ```df = df.rename(columns = {'column_x : 'column_y})```

- The first part is the traditional set up every. These are some things we should do before modifying the dataset.
- The second part involves cleaning the dataset and choosing columns that fit our methodology.
- The third part involves further splitting our cleaned dataframe into smaller dataframes and visualizing them.
- Finally, the fourth part involves summarizing our conclusion.


## Goals

## 1 - Getting Our Basic Data Analysis Set-Up

Import the libraries you will be using for this project. These libraries are the ones we have used in the previous labs.

In [5]:
import pandas as __ # INSERT CODE HERE
import _____ as np  # INSERT CODE HERE
import __________ as plt  # INSERT CODE HERE

### 1.1 Load file

In [11]:
url = 'https://raw.githubusercontent.com/bitprj/DigitalHistory/Amy/Week5-Lab-Visualizing-the-Translatlantic-Slave-Trade/data/dump.csv'

linkedin_profiles = __.read_csv(___) # INSERT CODE HERE

### Observing the Dataset using Pandas

Now, the dataset is loaded as a dataframe 'linkedin_profiles'

### 1.2 head()
Let's check what columns this file has by calling 'head()' function.
It returns first n rows, and it's useful to see the dataset at a quick glance.

By default, the head() function returns the first 5 rows.

For an example dataframe `df`, you can specify the number of rows to display by calling df.head(number).

In [13]:
# INSERT CODE HERE

   Unnamed: 0  ageEstimate  ...  avgMemberPosDuration avgCompanyPosDuration
0           0         41.0  ...              760.5000              989.9361
1           1         41.0  ...              760.5000              989.9361
2           2         41.0  ...              760.5000              747.2308
3           3         41.0  ...              760.5000              989.9361
4           4         30.0  ...              395.2857              683.3496

[5 rows x 27 columns]

### 1.3 tail()

The ```tail()``` method prints the last 5 rows of our dataset.

In [14]:
# INSERT CODE HERE

       Unnamed: 0  ageEstimate  ...  avgMemberPosDuration avgCompanyPosDuration
39532       39532         46.0  ...                1912.0              941.0968
39533       39533         46.0  ...                1912.0              941.0968
39534       39534         46.0  ...                1912.0              941.0968
39535       39535         46.0  ...                1912.0              941.0968
39536       39536         46.0  ...                1912.0              941.0968

[5 rows x 27 columns]

### 1.4 info()
This will return all of the column names and its types. This function is useful to get the idea of what the dataframe is like.

In [15]:
# INSERT CODE HERE

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39537 entries, 0 to 39536
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             39537 non-null  int64
 1   ageEstimate            39537 non-null  float64
 2   companyFollowerCount   38071 non-null  float64
 3   companyHasLogo         36407 non-null  object
 4   companyName            39535 non-null  object
 5   companyStaffCount      38401 non-null  float64
 6   companyUrl             37449 non-null  object
 7   companyUrn             39537 non-null  object
 8   connectionsCount       39537 non-null  float64
 9   country                39537 non-null  object
 10  endDate                30626 non-null  object
 11  followable             39537 non-null  float64
 12  followersCount         39537 non-null  float64
 13  genderEstimate         35567 non-null  object
 14  hasPicture             29601 non-null  object
 15  isPremium              39537 non-null  float64
 16  mbrLocation            39537 non-null  object
 17  mbrLocationCode        39389 non-null  object
 18  mbrTitle               39537 non-null  object
 19  memberUrn              39537 non-null  object
 20  posLocation            28411 non-null  object
 21  posLocationCode        16967 non-null  object
 22  posTitle               39537 non-null  object
 23  positionId             39537 non-null  float64
 24  startDate              39521 non-null  object
 25  avgMemberPosDuration   39312 non-null  float64
 26  avgCompanyPosDuration  38686 non-null  float64
dtypes: float64(10), int64(1), object(16)
memory usage: 8.1+ MB

### Observations:

#### Question:
List down the number of unique ```Dtype``` in this dataset
#### Answer: 

#### Question:
Is the dataset uneven? If so list down the column with the most missing rows? (ie the most NULL rows)
#### Answer:

### 1.5 describe()
describe() is used to view summary statistics of numeric columns. This will help you to have general idea of the dataset.

In [16]:
linkedin_profiles.________() # Insert code here

         Unnamed: 0   ageEstimate  ...  avgMemberPosDuration  avgCompanyPosDuration
count  39537.000000  39537.000000  ...          39312.000000           38686.000000
mean   19768.000000     38.434251  ...            875.186984             888.257529
std    11413.493133      9.626035  ...            639.812201             331.099677
min        0.000000     20.000000  ...              0.000000             -91.000000
25%     9884.000000     31.000000  ...            502.125000             724.861300
50%    19768.000000     38.000000  ...            730.600000             897.069100
75%    29652.000000     45.000000  ...           1068.919650            1039.168300
max    39536.000000     86.000000  ...          15492.500000            9497.000000

[8 rows x 11 columns]

### Observations:

#### Question:
FIXME Why is ```describe``` showing only 11 columns? Is it because of their types e.g(int,float,object)**?
#### Answer: 

#### Question:
Notice the statistics for `count`, `mean`, `std`, `min`, etc. What could be reason for the `count` value not being the same across all columns?
#### Answer:

#### Question:
Are the mean, standard deviation,..., max. important for all of the columns? Which ones might these values not be relevant for?
#### Answer:

#### shape
To see the size of the dataset, we can use shape function, which returns the number of rows and columns in a format of (#rows, #columns)

In [17]:
linkedin_profiles.shape

(39537, 27)

### Observations:

#### Question:
How many **rows** and **columns** are there?
#### Answer:

### 1.6 Important Facts About the Dataset

The next thing we want to do is count the number of job positions that are still active. We'll know this by observing the ```endDate``` This is simple, all we have to do is run two functions:
- The first one will be to check if the column has null values, ```isnull()```.
- The second one will be count the number of null values in the column, ```sum()```.

In [33]:
active_jobs = linkedin_profiles['endDate'].______().___()   # Insert Code Here
print(f'The total number of active jobs is:  {active_jobs}')

nan
2014-06-01
2012-12-01
2008-07-01
nan
2016-12-01
2015-12-01
2014-10-01
2013-06-01
2012-09-01
2011-08-01
The total number of active jobs is:  8911


**What about the total number of completed job positions?** </br>
The completed jobs are those that have a valid date in the `endDate` column. This means that these values are not NULL, which we can check by calling the `notnul()` method.
In the following line of code, we will have to ```sum``` the total number of completed jobs in every column.

In [34]:
number_of_completed_jobs = linkedin_profiles['endDate']._______().___()    # Insert code here
print(f'The total number of completed jobs are: {number_of_completed_jobs}')

The total number of completed jobs are: 30626

FIXME: This dataset has approximately 39500 job positions. This means that according to this dataset:

In [ ]:
possible_active_jobs = 39500 - number_of_completed_jobs 
possible_active_jobs

### Visualize the Number of Registered Profiles for each Company

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
linkedin_profiles.plot(x = 'Number of Profiles',
        y = 'Company Name',
        kind = 'histogram',
        c = 'FIXME Profile Age',
        title = 'Number of LinkedIn Registered Profiles for each Company',
        alpha = 0.3,cmap = plt.get_cmap('ocean'),
        colorbar = True,
        figsize = (20,10)
       )

## 2 - Getting Started with Data Wrangling

Now that we have observed the basic features of our dataset raw, we will began cleaning it. This involves several steps that you will be working through.

### Create a copy of the Original Dataset

In [ ]:
df = linkedin_profiles.copy()

### 2.4 Remove Unneeded columns -```df.drop()```

Now that we have a new index from 0 to 15299.

When we're looking at the database, for our purposes, we don't want to work with the ```companyHasLogo```,```companyUrl```, ```companyUrn```, ```followable```, ```mbrLocationCode```, ```mbrUrn```, ```posLocationCode```, ```positionId```. Next, we will use ```df.reindex()``` to change two things:
1. The order of our columns
2. Remove unneeded columnsL

Let's remove the columns that we don't need anymore: [ companyUrl, companyUrn, mbrLocationCode, mbrUrnn, posLocationCode, genderEstimate ]
FIXME: For Bonus questions, save the columns for [ companyFollowerCount, companyHasLogo, companyStaffCount, connectionsCount, followable, followersCount ] for additional analysis
FIXME: else, remove all [ companyFollowerCount, companyHasLogo, companyStaffCount, companyUrl, companyUrn, connectionsCount, followable, followersCount, mbrLocationCode, mbrUrnn, posLocationCode, genderEstimate ]

Next, drop these columnns

In [ ]:
df = df.drop(columns='_____')  # INSERT CODE HERE
df

### Using ```dropna()```

For this data set, we will be working with profiles that were completely accounted for in all of the remaining features.

The ```dropna()``` method is designed top drop every right in our dataframe whos cell might have a null or undefined value. There are usually shown as ```NaN```

In [ ]:
df = df.dropna()
df

In [ ]:
df.info()

### 2.1 Changing Column Names

For this exercise, you will change the names of the previously existing columns to something that is more readable. 

First, list down all the column names.

### 2.2 Column List

In [ ]:
list(df.______) # Insert Code Here

Next, write the names of the columns. We will rename the columns to be in snakecase form, in which each word in the variable name is lowercase and is separated by an underscore, and which looks like this: `my_sample_variable_name`.

The column names are: [ (profileId), ageEstimate, companyName, country, endDate, genderEstimate, startDate ]

In [ ]:
df = df.rename(
    columns={'COLUMN_NAME_HERE': 'profile_id',         # FIXME: Rename to snakecase and delete irrelevant stuff: Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'age',                          # Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'company_name',    # Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'country',   # Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'end_date',          # Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'gender',    # Insert Column Name you want to change
             'COLUMN_NAME_HERE': 'start_date',     # Insert Column Name you want to change
            })


df

### 2.3 Moving Column Positions - ```df.reindex()```

You can see below a list below which has the ```column_names``` in the order we want and is without the unneeded columns that we removed earlier.

In [ ]:
column_names = ['profile_id',"age_estimate","company_follower_count", "company_name","company_staff_count", "connections_count","country", "end_date", "followers_count","gender","has_picture","has_premium","member_location","member_title","position_location","position_title","start_date","avg_member_pos_duration","avg_company_pos_duration",]

df = df.reindex(columns=________) # FIXME: REORDER Insert Code here

df

**FIXME Not a relevant question? Is Voyage ID a good index and do we need it as a column?**

No, But we need an index.

**Can 'year_of_arrival' be an Index?**

No, because there are repeating dates in the charts, there for we need a simple log counter.

### 2.5 Changing Column Type and Sorting - ```df.sort_values()```

In [ ]:
df = df.sort_values(by='_______', ascending=True) # INSERT CODE HERE
df

### 2.6 Reseting the Index FIXME: Do we need to reset the index?

Reseting Index using ```df.reset_index``` with respect 'year_of_arrival' in Ascending Order.

In [ ]:
df.______(inplace=True, drop=True) # INSERT CODE HERE
df

### Finding Unique and similar strings 

First, we will list down all the unique names in these columns. Next, we will sort these in alphabetical order in order to make it easier to observe.

```df['column_name].unique()``` and ```df.sort()```

For simplicity I have just declared the first line as a variable ```a``` in order to print it

In [ ]:
a = df['company_name'].unique()
a.sort()
a

In [ ]:
a = df['position_location'].unique()
a.sort()
a

In [ ]:
a = df['position_title'].unique()
a.sort()
a

As we can see above our object columns, ```company_name```, ```position_location``` and ```position_title``` have phrases that are similar, but may differ by a city- or company specific- detail. We need to clean these out.

### 2.7 Working with Strings - ```df['column_name'].str.replace()```

To replace unwanted parts of a string, we use the function ```df['columun_name'].str.replace('string to find','string to replace')```. This command looks for the string we have specified and replaces with what we want.

For example:
FIXME: To remove the city, and also remove day/month from dates : If have an entry in the 'position_location' column, 'Sydney, Australia'. By running the command:
```df['position_location'].str.replace(', country', '')```
The string will be changed from ''Sydney, Australia' to 'Australia'.

In [ ]:
# We want to restructure the values for ```start_date``` and ```end_date``` to only provide the Year
# We need to remove the Month and Day from ```start_date```
df['start_date'] = df['start_date'].str.replace('STRING HERE', '')      # Insert string to replace

# We need to remove the Month and Day from ```end_date```
df['end_date'] = df['end_date'].str.replace('STRING HERE', '')    # Insert string to replace 

df

In [ ]:
df.dtypes

#### Creating a Copy of our modified Dataset

In [ ]:
modified_dataset = df.copy()

## 3 - Micro Wrangling and Visualization

We will Start of this part by dividing our dataset into multiple smaller dataframes. The approach we will be taking is separating dataframes based on the ```start_date``` data.

For example, in the blocks below you will see code for 4 intervals that indicate the start_date year that a profile user begins a job position:
- ```1960 to 1975```
- ```1975 to 1990```
- ```1990 to 2005```
- ```2005 to 2020```

## Between 1960 to 1975

In [ ]:
dataset_between60_75 = modified_dataset.where((modified_dataset['start_date'] >= 1960) & (modified_dataset['start_date'] <= 1975))
dataset_between60_75

In [ ]:
dataset_between60_75 = dataset_between60_75.dropna()
dataset_between60_75

### Total Number of Positions Started between 1960 - 1975 - Complete Records
FIXME: Get the number of profiles that fall in this category: The below code is incorrect

In [ ]:
dataset_between60_75.sum()

### FIXME Visualizing New Jobs during 1960 - 1975

In [ ]:
import matplotlib.pyplot as plt

fig = plt.figure(figsize = (20,10))

ax1 = fig.add_subplot(2,2,1)
ax2 = fig.add_subplot(2,2,2)
ax3 = fig.add_subplot(2,2,3)
ax4 = fig.add_subplot(2,2,4)
ax1.scatter(dataset_between60_75['start_date'],
            dataset_between60_75['slaves_onboard'],
            alpha = 0.4)

ax2.scatter(dataset_between60_75['slaves_onboard'],
            dataset_between60_75['start_date'],
            alpha = 0.4)

ax3.bar(
    dataset_between60_75['start_date'],
    dataset_between60_75['slaves_onboard'],
    alpha = 0.4)

ax4.set_ylim(1500,1600)
ax4.bar(
    dataset_between60_75['slaves_onboard'],    
    dataset_between60_75['start_date'],
    alpha = 0.4)

###  3.1 Choosing Graphs
- Which of these graphs seem useful and which ones are unnecessary?
**Write a 2 sentence explanation about why these two plots seem or might be useful.** **Did the visualization style influence your decision?**
Select the two graphs you think are more useful and add the following:
- Add ```title``` for both subplots.
- Add ```xlabel``` and ```ylabel```.
- Change the color for one of the plots

**Answer**

In [ ]:
# INSERT CODE HERE

### Pandas Plots

In [ ]:
dataset_between60_75.plot(x='company_name',
                         y = 'slaves_onboard',kind = 'bar', ax = ax1,
                         rot = 90)

### Companies with less than 1000 new positions started

In [ ]:
temp_plot = dataset_between60_75.where(dataset_between60_75['slaves_onboard'] < 100.0).dropna()

temp_plot

In [ ]:
temp_plot.plot(x='company_name',
                         y = 'slaves_onboard',kind = 'bar',
                         rot = 90)

### Companies with more than 1000 new positions started

In [ ]:
temp_plot = dataset_between60_75.where(dataset_between60_75['slaves_onboard'] > 100.0).dropna()

temp_plot.plot(x='company_name',
                         y = 'slaves_onboard',kind = 'bar',
                         rot = 90,grid = True,figsize = (20,10))

temp_plot

### Companies with more than 5000 new positions started

In [ ]:
temp_plot = dataset_between60_75.where(dataset_between60_75['slaves_onboard'] > 200.0).dropna()
print(f'There are {temp_plot.shape[0]} trips that carries more than 200 slaves.')

In [ ]:
temp_plot.plot(x='company_name',
                         y = 'slaves_onboard',kind = 'bar',
                         rot = 90,grid = True,figsize = (20,10))

### Check the most used 'company_name' for new_positions > 5000

In [ ]:
temp_plot['start_date'].hist(bins = 20,
                                 alpha = 0.5,
                                 xrot = 45,
                                 figsize = (10,10)
                                )

### Check the most used 'position_location' for new_positions > 5000

In [ ]:
temp_plot['voyage_pit_stop'].hist(bins=20, 
                           alpha=0.7,
                           xrot = 0,
                          figsize = (10,10))

### Check the most used 'gender'  for new_positions > 5000

In [ ]:
temp_plot['end_port'].hist(bins=20, 
                           alpha=0.7,
                           xrot = 0,
                          figsize = (10,10))

### Observations 

FIXME Majority of The Ships carrying over 200 people started their journey Portugal made a Pit-Stop in Africa and Went to Cartagena, Colombia

## Between 1975- 1990

In [ ]:
dataset_between75_90 = modified_dataset.where((modified_dataset['start_date'] >= 1601) & (modified_dataset['start_date'] <= 1700) )

dataset_between75_90

### 3.2 Drop null values

In [ ]:
dataset_between75_90 = dataset_between75_90._____() # Insert Code here (drop nul values)
dataset_between75_90

### 3.3 Total Number of Positions Started between 1975 - 1990 - Complete Records

In [ ]:
dataset_between75_90.slaves_onboard.___() # Insert Code Here - Sum of slaves

### Visualizing New Jobs during 1975 - 1990

In [ ]:
import matplotlib.pyplot as plt

fig = plt.figure(figsize = (20,10))

ax1 = fig.add_subplot(2,1,1)
ax2 = fig.add_subplot(2,1,2)

ax1.scatter(dataset_between75_90['year_of_arrival'],
            dataset_between75_90['slaves_onboard'],
            alpha = 0.4)

ax2.bar(
    dataset_between75_90['year_of_arrival'],
    dataset_between75_90['slaves_onboard'],
    alpha = 0.4
    )

### 3.4 Pandas Plots

In [ ]:
# INSERT CODE HERE

### 3.5 Check the most used 'company_name' for new_positions > 5000

In [ ]:
# INSERT CODE HERE

### 3.6 Check the most used 'position_location' for new_positions > 5000

In [ ]:
# INSERT CODE HERE

### 3.7 Check the most used 'End_Port'

In [ ]:
# INSERT CODE HERE

## Between 1990 - 2005

In [ ]:
dataset_between90_05 = modified_dataset.where((modified_dataset['start_date'] >= 1990) & (modified_dataset['start_date'] <= 2005) )

dataset_between90_05

In [ ]:
dataset_between90_05 = dataset_between90_05.dropna()

dataset_between90_05

### 3.8 Total Number of New Positions between 1990 - 2005 - Complete Records

### 3.9 Visualizing New Positions During 1990 - 2005

### 3.10 Pandas Plots

### 3.11 Check the most used 'company_name' for new_positions > 5000

### 3.12 Check the most used 'position_location' for new_positions > 5000

### 3.13 Check the most used 'End_Port'

# Extra Credit
## Between 1801- 1900

In [ ]:
dataset_between18_19 = modified_dataset.where((modified_dataset['start_date'] >= 1801) & (modified_dataset['start_date'] <= 1900) )

dataset_between18_19

In [ ]:
dataset_between18_19 = dataset_between18_19.dropna()

dataset_between18_19

### Total Number of New Positions between 1990 - 2005 - Complete Records

### Visualizing New Jobs During 1990 - 2005

### Pandas Plots

### Check the most used 'company_name' for new_positions > 5000

### Check the most used 'position_location' for new_jobs > 5000

### Check the most used 'End_Port'

# Conclusion

## Resources

# Appendix

## Connecting to Your Google Drive

In [ ]:
# Start by connecting google drive into google colab

from google.colab import drive

drive.mount('/content/gdrive')

In [ ]:
!ls "/content/gdrive/My Drive/DigitalHistory"

In [ ]:
cd "/content/gdrive/My Drive/DigitalHistory/tmp/trans-atlantic-slave-trade"

In [ ]:
ls

In [ ]:
### Extracting ZipFiles

In [ ]:

import zipfile

In [ ]:
file_location = 'data/trans-atlantic-slave-trade.csv.zip'

zip_ref = zipfile.ZipFile(file_location,'r')
zip_ref.extractall('data/tmp/trans-atlantic-slave-trade')
zip_ref.close()

### Checking and Changing Column Types 
```df.dtypes``` and ```df.astype()```

In [ ]:
df.dtypes

In [ ]:
df.year_of_arrival.astype(int)

In [ ]:
df.dtypes

In [ ]:
df.year_of_arrival = df.year_of_arrival.astype(int)

In [ ]:
df.dtypes

**Extra**:
```df.slaves_onboard = df.slaves_onboard.astype(int)```

In [ ]:
df.slaves_onboard = df.slaves_onboard.astype(int)

In [ ]:
df.dtypes

In [ ]:
df

### GeoTagging Locations

In [ ]:
!pip install geopandas

In [ ]:
!pip install googlemaps

In [ ]:
from googlemaps import Client as GoogleMaps
import pandas as pd

In [ ]:
gmaps = GoogleMaps('')# ENTER KEY

In [ ]:
df

In [ ]:
addresses = df.filter(['Voyage itinerary imputed port where began (ptdepimp) place'], axis=1)
addresses.head()

In [ ]:
addresses['long'] = ""
addresses['lat'] = ""

In [ ]:
addresses